Autodesk.Revit.DB.Structure.TrussTypeSet
A set that contains Truss types.

Autodesk.Revit.DB.Structure.TrussTypeSet.Insert(Autodesk.Revit.DB.Structure.TrussType)
System.Int32
Insert the specified Truss type into the set.
item: The Truss type to be inserted into the set.
Returns: Returns whether the Truss type was inserted into the set.

Autodesk.Revit.DB.Structure.TrussTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.TrussTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.TrussTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.TrussTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.TrussTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.TrussTypeSet.Erase(Autodesk.Revit.DB.Structure.TrussType)
System.Int32
Removes a specified Truss type from the set.
item: The Truss type to be erased.
Returns: The number of Truss types that were erased from the set.

Autodesk.Revit.DB.Structure.TrussTypeSet.Contains(Autodesk.Revit.DB.Structure.TrussType)
System.Boolean
Tests for the existence of a Truss type within the set.
item: The Truss type to be searched for.
Returns: The Contains method returns True if the Truss type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.TrussTypeSet.Clear
void
Removes every Truss type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.TrussTypeSet.Size
System.Int32
get
Returns the number of Truss types that are in the set.

Autodesk.Revit.DB.Structure.TrussTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.